Packages Python : Beautiful soup, NLTK, Tensorflow (algorithm), sklearn, fast API crée des API, pandas

# S1 : RAPPEL M1

## If - else et For i in range

In [1]:
# Exercice 3 TP1 - si a est pair ou impair
a = 13
a%2

1

In [2]:
# Si a est pair (ou impair)
# 1 => True
# 0 => False

if a%2 ==0 : 
    print ('a est pair')
else : 
    print ('a est impair')

a est impair

In [3]:
# Si un nombre est < 5
a<5

False

In [4]:
a = 8
if a<5 ==True :
    print ('a est inférieur à 5')
else : 
    print ('a est égal ou supérieur à 5')

a est égal ou supérieur à 5

In [5]:
a = 5
if a<5 : 
    print ('a est inférieur à 5')
elif a>5 : 
    print ('a est supérieur à 5')
else : 
    print ('a est égal 5')

a est égal 5

In [6]:
def is_odd(a: int):
    return a%2

In [7]:
is_odd(6)

0

In [8]:
# Fonctionnement de list
# Créer les factorielles, n! = 1*2*3*...*n
list(range(2,11,2))

[2, 4, 6, 8, 10]

In [9]:
list(range(1,11))

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [10]:
k=1
for i in range(1,11) :
    k=k*i
    print (i,'! =', k)

1 ! = 1
2 ! = 2
3 ! = 6
4 ! = 24
5 ! = 120
6 ! = 720
7 ! = 5040
8 ! = 40320
9 ! = 362880
10 ! = 3628800

In [11]:
# Correction
def factorial(n):
    result = 1
    for i in range(1,n+1):
        result = result * i
    return result

In [12]:
factorial(6)

720

## Manipulation de list

In [13]:
l = [1, "hello", 54]
print(l)

[1, 'hello', 54]

In [14]:
l.append('2345')
print(l)

[1, 'hello', 54, '2345']

In [15]:
l[1:5:2]

['hello', '2345']

In [16]:
# créez la liste des nombres entiers de 1 à 10
une_liste = list(range(1,11))
une_liste

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [18]:
# afficher un élement sur 2 de la liste
une_liste[1::2]

[2, 4, 6, 8, 10]

In [19]:
# liste inversée
une_liste[::-1]

[10, 9, 8, 7, 6, 5, 4, 3, 2, 1]

In [20]:
# créer une liste de nombre entiers de 1 à 100 en utilisant une boucle for et le mot clef "append".
une_deuxieme_liste = []
for i in range(1,101) :
    une_deuxieme_liste.append(i)
print(une_deuxieme_liste)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100]

In [21]:
# afficher le contenu des éléments des indexes 2 à 6
une_deuxieme_liste[2:7]

[3, 4, 5, 6, 7]

## Dictionnaire

In [22]:
dictionnaire = {"nom1": "prenom1", "nom2": "prenom2"}

In [23]:
dict.keys(dictionnaire)

dict_keys(['nom1', 'nom2'])

In [24]:
# Exercice 7 : Les dictionnaires

# définir un dictionnaire contenant 3 couples clefs, valeurs.
dutch = {"een":"un", "twee":"deux", "drei":"trois"}
# afficher le dictionnaire
dutch

{'een': 'un', 'twee': 'deux', 'drei': 'trois'}

In [25]:
# afficher la liste des clefs du dictionnaire
dict.keys(dutch)

dict_keys(['een', 'twee', 'drei'])

In [26]:
dict.values(dutch)

dict_values(['un', 'deux', 'trois'])

In [24]:
for k in dutch.items():
    print(k)

('een', 'un')
('twee', 'deux')
('drei', 'trois')

# S2 : PACKAGE PANDAS

In [27]:
# Importer des packages
import numpy as np
import pandas as pd

## Séries pandas - pd.Series()

In [33]:
# Créer 1 série : 1 dimension 
obj = pd.Series ([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [34]:
print(f"Array: {obj.array}")

Array: <PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [35]:
print(f"Index: {obj.index}")

Index: RangeIndex(start=0, stop=4, step=1)

In [39]:
obj>0

0     True
1     True
2    False
3     True
dtype: bool

In [40]:
obj[obj>0]

0    4
1    7
3    3
dtype: int64

In [41]:
obj[-obj>0]

2   -5
dtype: int64

In [42]:
obj*2

0     8
1    14
2   -10
3     6
dtype: int64

In [43]:
# Créer un dictionnaire et le convertir en série
sdata = {"Ohio": 3500, "Texas": 71000, "Oregon":16000}
obj3 = pd.Series(sdata)
obj3

Ohio       3500
Texas     71000
Oregon    16000
dtype: int64

In [46]:
# On peut reconvertir la série panda à un dictionnaire si on veut
obj3.to_dict()

{'Ohio': 3500, 'Texas': 71000, 'Oregon': 16000}

## DataFrame pandas - pd.DataFrame()

In [48]:
# On peut définir un dictionnaire et le transformer à un dataframe
data = {"state":["Ohio","Ohio","Nevada","Nevada"],
       "year":["2000","2001","2001","2002"],
       "pop":[1.5,1.7,3.6,2.4]} # C'est un dictionnaire
frame = pd.DataFrame(data)
frame # C'est un dataframe

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2  Nevada  2001  3.6
3  Nevada  2002  2.4

In [51]:
# Pour les 2 premières : frame.head(2)
frame.tail(2) # et 2 dernières

    state  year  pop
2  Nevada  2001  3.6
3  Nevada  2002  2.4

In [52]:
frame["state"] # affichier les valeurs de la colonne "state"

0      Ohio
1      Ohio
2    Nevada
3    Nevada
Name: state, dtype: object

In [53]:
frame.state # ça marche aussi

0      Ohio
1      Ohio
2    Nevada
3    Nevada
Name: state, dtype: object

In [54]:
type(frame["state"])

pandas.core.series.Series

In [55]:
frame.loc[1] # Pour afficher l'info de l'index 1, loc prend en argument un index
# donc, si on remplace l'index par les lettres, on doit mettre iloc[1]

state    Ohio
year     2001
pop       1.7
Name: 1, dtype: object

In [67]:
# Exemple 
frame2 = frame.copy()
frame2.index = ["d","a","c","b"]
frame2

    state  year  pop  debt
d    Ohio  2000  1.5   0.0
a    Ohio  2001  1.7   1.0
c  Nevada  2001  3.6   2.0
b  Nevada  2002  2.4   3.0

In [63]:
frame2.iloc[1]

state    Ohio
year     2001
pop       1.7
debt      1.0
Name: b, dtype: object

In [59]:
frame["debt"] = np.arange(4.)
frame # ajouter une colonne avec les valeurs de 0 à 3

    state  year  pop  debt
0    Ohio  2000  1.5   0.0
1    Ohio  2001  1.7   1.0
2  Nevada  2001  3.6   2.0
3  Nevada  2002  2.4   3.0

## Index selection and filtering

## Sorting and Ranking

In [66]:
frame.sort_index()

    state  year  pop  debt
0    Ohio  2000  1.5   0.0
1    Ohio  2001  1.7   1.0
2  Nevada  2001  3.6   2.0
3  Nevada  2002  2.4   3.0

In [69]:
frame2.sort_index()

    state  year  pop  debt
a    Ohio  2001  1.7   1.0
b  Nevada  2002  2.4   3.0
c  Nevada  2001  3.6   2.0
d    Ohio  2000  1.5   0.0

In [ ]:
# https://github.com/data-corentinv/ensp-data-analysis-univ-lille/blob/main/notebooks/Getting%20Started%20with%20Pandas.ipynb